###################################################################

# Created by write_sdc on Sun Feb 21 00:16:48 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {IRAM_add[31]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[30]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[29]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[28]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[27]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[26]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[25]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[24]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[23]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[22]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[21]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[20]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[19]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[18]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[17]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[16]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[15]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[14]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[13]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[12]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[11]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[10]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[9]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[8]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[7]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[6]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[5]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[4]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[3]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[2]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[1]}]
set_load -pin_load 3.40189 [get_ports {IRAM_add[0]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[31]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[30]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[29]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[28]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[27]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[26]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[25]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[24]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[23]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[22]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[21]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[20]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[19]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[18]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[17]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[16]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[15]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[14]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[13]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[12]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[11]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[10]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[9]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[8]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[7]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[6]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[5]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[4]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[3]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[2]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[1]}]
set_load -pin_load 3.40189 [get_ports {Dram_add[0]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[31]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[30]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[29]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[28]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[27]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[26]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[25]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[24]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[23]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[22]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[21]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[20]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[19]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[18]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[17]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[16]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[15]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[14]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[13]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[12]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[11]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[10]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[9]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[8]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[7]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[6]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[5]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[4]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[3]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[2]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[1]}]
set_load -pin_load 3.40189 [get_ports {Dram_data_in[0]}]
set_load -pin_load 3.40189 [get_ports Dram_we]
set_load -pin_load 3.40189 [get_ports Dram_rd]
create_clock [get_ports Clk]  -name MY_CLK  -period 5.2  -waveform {0 2.6}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports Clk]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports Rst]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_out[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_out[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_add[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_add[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Dram_data_in[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports Dram_we]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports Dram_rd]
